avr-rust/avrd/packs/atmega/ATmega329.atdf
        <register caption="ADC Data Register  Bytes" name="ADC" offset="0x78" size="2" mask="0xFFFF"/>
        <register caption="ADC Control and Status Register B" name="ADCSRB" offset="0x7B" size="1">
          <bitfield caption="ADC Auto Trigger Sources" mask="0x07" name="ADTS"/>
        </register>
        <register caption="Digital Input Disable Register 0" name="DIDR0" offset="0x7E" size="1">
          <bitfield caption="ADC7 Digital input Disable" mask="0x80" name="ADC7D"/>
          <bitfield caption="ADC6 Digital input Disable" mask="0x40" name="ADC6D"/>
          <bitfield caption="ADC5 Digital input Disable" mask="0x20" name="ADC5D"/>
          <bitfield caption="ADC4 Digital input Disable" mask="0x10" name="ADC4D"/>
          <bitfield caption="ADC3 Digital input Disable" mask="0x08" name="ADC3D"/>
          <bitfield caption="ADC2 Digital input Disable" mask="0x04" name="ADC2D"/>
          <bitfield caption="ADC1 Digital input Disable" mask="0x02" name="ADC1D"/>
          <bitfield caption="ADC0 Digital input Disable" mask="0x01" name="ADC0D"/>
        </register>
      </register-group>
      <value-group caption="" name="ANALOG_ADC_V_REF3">
        <value caption="AREF, Internal Vref turned off" name="VAL_0x00" value="0x00"/>
        <value caption="AVCC with external capacitor at AREF pin" name="VAL_0x01" value="0x01"/>
        <value caption="Reserved" name="VAL_0x02" value="0x02"/>
        <value caption="Internal 1.1V Voltage Reference with external capacitor at AREF pin" name="VAL_0x03" value="0x03"/>
      </value-group>
      <value-group caption="" name="ANALOG_ADC_PRESCALER">
        <value caption="2" name="VAL_0x00" value="0x00"/>
        <value caption="2" name="VAL_0x01" value="0x01"/>
        <value caption="4" name="VAL_0x02" value="0x02"/>
        <value caption="8" name="VAL_0x03" value="0x03"/>
        <value caption="16" name="VAL_0x04" value="0x04"/>
        <value caption="32" name="VAL_0x05" value="0x05"/>
        <value caption="64" name="VAL_0x06" value="0x06"/>
        <value caption="128" name="VAL_0x07" value="0x07"/>
      </value-group>
    </module>
    <module caption="Bootloader" name="BOOT_LOAD">
      <register-group caption="Bootloader" name="BOOT_LOAD">
        <register caption="Store Program Memory Control Register" name="SPMCSR" offset="0x57" size="1">
          <bitfield caption="SPM Interrupt Enable" mask="0x80" name="SPMIE"/>
          <bitfield caption="Read While Write Section Busy" mask="0x40" name="RWWSB"/>
          <bitfield caption="Read While Write section read enable" mask="0x10" name="RWWSRE"/>
          <bitfield caption="Boot Lock Bit Set" mask="0x08" name="BLBSET"/>
          <bitfield caption="Page Write" mask="0x04" name="PGWRT"/>
          <bitfield caption="Page Erase" mask="0x02" name="PGERS"/>
          <bitfield caption="Store Program Memory Enable" mask="0x01" name="SPMEN"/>
        </register>
      </register-group>
    </module>
    <module caption="USART" name="USART">
      <register-group caption="USART" name="USART0">
        <register caption="USART I/O Data Register" name="UDR0" offset="0xC6" size="1" mask="0xFF" ocd-rw=""/>
        <register caption="USART Control and Status Register A" name="UCSR0A" offset="0xC0" size="1" ocd-rw="R">
          <bitfield caption="USART Receive Complete" mask="0x80" name="RXC0"/>
          <bitfield caption="USART Transmit Complete" mask="0x40" name="TXC0"/>
          <bitfield caption="USART Data Register Empty" mask="0x20" name="UDRE0"/>
          <bitfield caption="Framing Error" mask="0x10" name="FE0"/>
          <bitfield caption="Data OverRun" mask="0x08" name="DOR0"/>
          <bitfield caption="USART Parity Error" mask="0x04" name="UPE0"/>
          <bitfield caption="Double the USART Transmission Speed" mask="0x02" name="U2X0"/>
          <bitfield caption="Multi-processor Communication Mode" mask="0x01" name="MPCM0"/>
        </register>
        <register caption="USART Control and Status Register B" name="UCSR0B" offset="0xC1" size="1">
          <bitfield caption="RX Complete Interrupt Enable" mask="0x80" name="RXCIE0"/>
          <bitfield caption="TX Complete Interrupt Enable" mask="0x40" name="TXCIE0"/>
          <bitfield caption="USART Data Register Empty Interrupt Enable" mask="0x20" name="UDRIE0"/>
          <bitfield caption="Receiver Enable" mask="0x10" name="RXEN0"/>
          <bitfield caption="Transmitter Enable" mask="0x08" name="TXEN0"/>
          <bitfield caption="Character Size" mask="0x04" name="UCSZ02"/>
          <bitfield caption="Receive Data Bit 8" mask="0x02" name="RXB80"/>
          <bitfield caption="Transmit Data Bit 8" mask="0x01" name="TXB80"/>
        </register>
        <register caption="USART Control and Status Register C" name="UCSR0C" offset="0xC2" size="1">
          <bitfield caption="USART Mode Select" mask="0x40" name="UMSEL0" values="COMM_USART_MODE"/>
          <bitfield caption="Parity Mode Bits" mask="0x30" name="UPM0" values="COMM_UPM_PARITY_MODE"/>
          <bitfield caption="Stop Bit Select" mask="0x08" name="USBS0" values="COMM_STOP_BIT_SEL"/>
          <bitfield caption="Character Size" mask="0x06" name="UCSZ0"/>
          <bitfield caption="Clock Polarity" mask="0x01" name="UCPOL0"/>
        </register>
        <register caption="USART Baud Rate Register  Bytes" name="UBRR0" offset="0xC4" size="2" mask="0x0FFF"/>
      </register-group>
      <value-group caption="" name="COMM_USART_MODE">
        <value caption="Asynchronous Operation" name="VAL_0x00" value="0x00"/>
        <value caption="Synchronous Operation" name="VAL_0x01" value="0x01"/>
      </value-group>
      <value-group caption="" name="COMM_UPM_PARITY_MODE">
        <value caption="Disabled" name="VAL_0x00" value="0x00"/>
        <value caption="Reserved" name="VAL_0x01" value="0x01"/>
        <value caption="Enabled, Even Parity" name="VAL_0x02" value="0x02"/>
        <value caption="Enabled, Odd Parity" name="VAL_0x03" value="0x03"/>
      </value-group>
